app/views/posts/_post.html.erb

<div class="row display">
	<% if current_user && current_user.votes.exists?(post_id: post.id, vote_type: 'up') %>
---
SELECT 1 AS one FROM "votes" WHERE "votes"."user_id" = $1 AND "votes"."post_id" = 1 AND "votes"."vote_type" = 'up' LIMIT 1  [["user_id", 3]]


					<% if !post.tweets.find_by_user_id(current_user) %>
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."post_id" = $1 AND "tweets"."user_id" IS NULL LIMIT 1  [["post_id", 1]]