app/controllers/posts_controller.rb

  def create

    if params[:commit] == 'Create and Tweet my post'
      if Tweet.create_and_post(params[:post][:body], current_user.id)
---
INSERT INTO "posts" ("body", "created_at", "tweet_body", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "tweets" ("created_at", "post_id", "tweet_id", "tweet_json", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def index
    @posts = Post.where(:deleted => 'false', :disabled => 'false').order('updated_at DESC')
---
SELECT "posts".* FROM "posts" WHERE "posts"."deleted" = 'false' AND "posts"."disabled" = 'false' ORDER BY updated_at DESC, posts.vote_count DESC

  def disable
    post = Post.find(params[:id]);
    if post.update_attributes(:disabled => 'true')
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY posts.vote_count DESC LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "disabled" = $1, "updated_at" = $2 WHERE "posts"."id" = 2  [["disabled", true], ["updated_at", Mon, 29 Jul 2013 21:20:40 UTC +00:00]]