app/controllers/sessions_controller.rb

  def create
  	#raise request.env['omniauth.auth'].to_yaml

  	auth_hash = request.env['omniauth.auth']

  	if (authorization = Authorization.find_by_provider_and_uid(auth_hash['provider'], auth_hash["uid"]))
      flash[:success] = "Welcome back #{authorization.user.name}!"
      session[:name] = authorization.user.name
      session[:uid] = authorization.user.id
      unless current_user
        flash[:warning] = "In order to participate you need to respond to a <a href='/posts/'>survey.</a>".html_safe
      end
    else
      user = User.create_with_omniauth(auth_hash, session[:turkerId])
      authorization = Authorization.create(:provider => auth_hash['provider'], :uid => auth_hash['uid'], :user => user)
---
SELECT "authorizations".* FROM "authorizations" WHERE "authorizations"."provider" = 'twitter' AND "authorizations"."uid" = '1546208004' LIMIT 1
INSERT INTO "users" ("created_at", "name", "t_access_secret", "t_access_token", "t_created_at", "t_description", "t_followers_count", "t_image", "t_listed_count", "t_location", "t_nickname", "t_screen_name", "t_statuses_count", "twitter_json", "updated_at", "user_level", "version_string") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
INSERT INTO "authorizations" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 23 Jul 2013 21:15:51 UTC +00:00], ["provider", "twitter"], ["uid", "1604280110"], ["updated_at", Tue, 23 Jul 2013 21:15:51 UTC +00:00], ["user_id", 1]]