app/controllers/surveys_controller.rb

	def create
    @sr = Survey.new params[:survey]
    respond_to do |format|

	    # TODO: Refactor?
	    # Maybe there should be a surveys controller for setting up the surveys and a survey entry controller for filling them out
	    # Furthermore, assignment into conditions should probably be handled somewhere else, perhaps in the users model
			if @sr.save

				@user = User.find(session[:uid]).update_attributes(:survey_id => @sr.id)
---
INSERT INTO "surveys" ("created_at", "ils1", "ls1", "ls2", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Tue, 23 Jul 2013 20:42:45 UTC +00:00], ["ils1", 2], ["ls1", 4], ["ls2", 2], ["updated_at", Tue, 23 Jul 2013 20:42:45 UTC +00:00], ["user_id", 3]]
SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "users" SET "condition" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["condition", "participant"], ["updated_at", Tue, 30 Jul 2013 03:38:29 UTC +00:00]]