app/controllers/tweets_controller.rb

	def tweet
		if(Tweet.find_by_post_id(params[:id])) #already has a tweet, try to retweet it
			if (str = Tweet.retweet(params[:id], current_user.id)) #try to retweet
				if str == "Dupe"
					flash[:warning] = "Unable to tweet, you've already tweeted this!"
				elsif str == "Failed to save"
					flash[:warning] = "You tweeted!"
				else
					flash[:success] = "You retweeted: " + Post.find(params[:id]).body
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."post_id" = $1 ORDER BY "tweets"."id" ASC LIMIT 1  [["post_id", 4]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY posts.vote_count DESC LIMIT 1  [["id", "1"]]