app/controllers/votes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY posts.vote_count DESC LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "vote_count" = $1, "updated_at" = $2 WHERE "posts"."id" = 2  [["vote_count", 5], ["updated_at", Mon, 29 Jul 2013 17:45:58 UTC +00:00]]
---
  def new
    @post = Post.find(params[:post_id])
    #if current_user.able_to_vote?(@post)
      current_user.toggle_vote(@post, params[:vote_type])